import React from "react";
import styled from "styled-components";
import pic from "../utils/دماوند.jpg";

const About = () => {
  return (
    <Wrapper>
      <h2 className="my-5 text-center">درباره شهر</h2>
      <div>
        <div className="text-center">
          <h4 className="mb-3 title_2">شهرستان دماوند و ویژگی‌های آن</h4>
          <img src={pic} alt="city" />
        </div>
        <p>
          شهرستان دماوند که در استان تهران واقع شده است، با مساحتی حدود 188 هزار
          هکتار در محدوده شهرستان‌های فیروزکوه، آمل، ورامین و گرمسار قرار دارد و
          منطقه‌ای کوهستانی با آب‌وهوای بی‌نظیر است. متوسط ارتفاع این شهرستان از
          سطح دریا حدود 2000 متر است و از میزان 188 هزار هکتار مساحت شهرستان،83
          درصد آن جزو منابع ملی محسوب می‌شود و 16 درصد به زمین‌های کشاورزی
          اختصاص دارد و حدود یک درصد باقیمانده نیز جزو حوزه شهری است. این
          شهرستان، از طبیعت جذاب، چشم‌نواز و منحصر به فردی برخوردار است که
          مهمترین جذابیت خود را مدیون بلندترین قله ایران یعنی قله دماوند است.
          همچنین وجود رودخانه‌های متعددی که از کوه دماوند سرچشمه می‌گیرند، در
          آبادانی باغ‌ها و مزارع کشاورزی اطراف این شهرستان سهم قابل‌توجهی داشته
          و موجب به وجود آمدن نواحی ییلاقی با چشم‌اندازهای زیبایی در منطقه
          شده‌اند. به علاوه چشمه‌های متعدد آب گرم و معدنی در نواحی ییلاقی با
          چشم‌اندازهای گوناگون فصلی، دریاچه‌های کوچک و بزرگ دایمی و فصلی با آب
          شیرین، جلوه‌های زیبایی از طبیعت ایران را در این منطقه از استان تهران
          به نمایش گذاشته‌اند. شهرستان دماوند دارای تعداد زیادی شهرهای دیدنی است
          که هر کدام از آنها جاذبه‌های تاریخی و گردشگری بسیاری را در خود جای
          داده‌اند.
        </p>
      </div>
    </Wrapper>
  );
};
const Wrapper = styled.div`
  background: #fcfcfc;
  img {
    border-radius: 10px;
    box-shadow: 3px 5px 35px rgba(86, 68, 169, 0.1);
  }
  p {
    width: 70%;
    text-align: center;
    margin: 2rem auto;
    -webkit-letter-spacing: 1px;
    -moz-letter-spacing: 1px;
    -ms-letter-spacing: 1px;
    letter-spacing: 1px;
    line-height: 27px;
    font-size: 1.2rem;
  }
`;
export default About;
